# VoltageTypeSetIterator Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
VoltageTypeSetIterator Class
Members See Also
---
An iterator to a voltage type set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract class VoltageTypeSetIterator : APIObject,
	IEnumerator
```

Visual Basic
---
```text
Public MustInherit Class VoltageTypeSetIterator _
	Inherits APIObject _
	Implements IEnumerator
```

Visual C++
---
```text
public ref class VoltageTypeSetIterator abstract : public APIObject,
	IEnumerator
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB.Electrical..::..VoltageTypeSetIterator
# See Also
VoltageTypeSetIterator Members
Autodesk.Revit.DB.Electrical Namespace